In [1]:
import pandas as pd

In [2]:
stocks = pd.read_csv('https://bit.ly/smallstocks')

In [3]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [4]:
stocks.index

RangeIndex(start=0, stop=9, step=1)

In [5]:
# groupby Symbol and calculate mean of closing point
# "for each Symbol" what is the mean of closing price?
stocks.groupby(by='Symbol')['Close'].mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [6]:
# creating multi-index by grouping 'Symbol'&'Date'
# This is saying for "each pair of Symbol and Date" what is the mean of closing price?
ser = stocks.groupby(by=['Symbol','Date'])['Close'].mean()

## Series multi-index

In [7]:
# this is a series with multi-index
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [8]:
# check for multi-index
# multi-index add another dimension to data
# series is 1 dimensional data != series with multi-index is 2 dimension
ser.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [9]:
# unstack multi-index series --> dataframe
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [10]:
# or doing pivot_table
# value la gia tri trong bang can phai dat ten moi.
df = stocks.pivot_table(values='Close',columns='Date',index='Symbol')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

## Selection

In [11]:
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

## Selecting with multi-index
- using .loc name the outer index and inner index

### Select from the outer level by naming it

In [12]:
# getting all the data of Apple
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

### Select from the outer level and inner level

In [13]:
# getting data of apple on 2016-10-03
ser.loc['AAPL', '2016-10-03']

112.52

### Select from the inner level 
- Asking which level 0 == level Symbol do I want (want all :)
- Which level 1 == level Date do I want (want 2016-10-03)

In [14]:
# getting all symbol data on 2016-10-03
# asking which level 0 == level Symbol do I want (want all :)
# which level 1 == level Date do I want (want 2016-10-03)
ser.loc[:,'2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

## Series multi-index using reshape to look like DataFrame still using the above selection

In [15]:
df = stocks.pivot_table(values='Close',columns='Date',index='Symbol')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [16]:
# using value of level Symbol not the actual 'Symbol'
df.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: AAPL, dtype: float64

In [17]:
df.loc['AAPL','2016-10-03']

112.52

In [18]:
df.loc['AAPL':'CSCO','2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
Name: 2016-10-03, dtype: float64

## DataFrame multi-index

In [19]:
# create multi-index dataFrame by Symbol, and Date
stocks.set_index(keys=['Symbol','Date'],inplace=True)

In [20]:
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [21]:
# check for multi-index DataFrame
stocks.index

MultiIndex([('CSCO', '2016-10-03'),
            ('AAPL', '2016-10-03'),
            ('MSFT', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('MSFT', '2016-10-04'),
            ('CSCO', '2016-10-04'),
            ('MSFT', '2016-10-05'),
            ('CSCO', '2016-10-05'),
            ('AAPL', '2016-10-05')],
           names=['Symbol', 'Date'])

In [22]:
stocks.sort_index(inplace=True)

In [23]:
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

## Selection outer most index, index level 0

In [24]:
# select outer most level for index 
# index level 0
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

## Selection outer inner index, index level 0 & 1
- for good practice it is good to wrap all index and col selection in tuple

In [25]:
stocks.loc[('AAPL','2016-10-03'), :]

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [26]:
stocks.loc[('AAPL','2016-10-03'), 'Close']

112.52

## Selection multiple outer most index

In [27]:
# using indexing to select apple and cisco on 2016-10-03
stocks.loc[(['AAPL','CSCO'],'2016-10-03'),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
CSCO   2016-10-03   31.50  14070500

In [28]:
# using indexing to select apple on 2016-10-03 and 2016-10-05
stocks.loc[('AAPL',['2016-10-03','2016-10-05']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-05  113.05  21453100

### Notice want all value in level 0 of index must use:
- slice(None)

In [29]:
# using indexing to select all stock on 2016-10-03 and 2016-10-05
stocks.loc[(slice(None),['2016-10-03','2016-10-05']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-05   57.64  16726400

## How to concat on more than 1 level

In [30]:
volume = pd.read_csv('https://bit.ly/smallstocks',usecols=[0,2,3],
                    index_col=['Symbol','Date'])

In [31]:
volume

                     Volume
Symbol Date
CSCO   2016-10-03  14070500
AAPL   2016-10-03  21701800
MSFT   2016-10-03  19189500
AAPL   2016-10-04  29736800
MSFT   2016-10-04  20085900
CSCO   2016-10-04  18460400
MSFT   2016-10-05  16726400
CSCO   2016-10-05  11808600
AAPL   2016-10-05  21453100

In [37]:
close = pd.read_csv('https://bit.ly/smallstocks',usecols=[0,1,3],
                    index_col=['Symbol','Date'])
close

                    Close
Symbol Date
CSCO   2016-10-03   31.50
AAPL   2016-10-03  112.52
MSFT   2016-10-03   57.42
AAPL   2016-10-04  113.00
MSFT   2016-10-04   57.24
CSCO   2016-10-04   31.35
MSFT   2016-10-05   57.64
CSCO   2016-10-05   31.59
AAPL   2016-10-05  113.05

### Using merge to merge multi-index (close, volume)

In [40]:
# using left_index and right_index to merge index
both = (pd.merge
        (left=close,
         right=volume,
         left_index=True,
         right_index=True))

In [43]:
both.sort_index(inplace=True)

In [44]:
# using reset_index --> original index (tidy-data)
both.reset_index()

  Symbol        Date   Close    Volume
0   AAPL  2016-10-03  112.52  21701800
1   AAPL  2016-10-04  113.00  29736800
2   AAPL  2016-10-05  113.05  21453100
3   CSCO  2016-10-03   31.50  14070500
4   CSCO  2016-10-04   31.35  18460400
5   CSCO  2016-10-05   31.59  11808600
6   MSFT  2016-10-03   57.42  19189500
7   MSFT  2016-10-04   57.24  20085900
8   MSFT  2016-10-05   57.64  16726400